// import axios from "axios";
export default {
    namespaced: true,
    state: () => ({
        list: [],
        loading: false
    }),
    mutations: {
        SET_LIST(state, data) {
            state.list = data;
        },
        SET_LOADING(state, data) {
            state.loading = data;
        }
    },
    actions: {
        async loadList({commit}, _) {
            const setLoading = (value = true) => commit('SET_LOADING', value);

            setLoading(true);

            // const data = await axios.get("https://random-data-api.com/api/users/random_user?size=3");
            const data = [{
                            "word": "яблуко",
                            "meaning": "круглий фрукт із червоною або зеленою шкіркою та білим м'якушем всередині",
                            "usage": "Я з'їв смачне яблуко на перекус.",
                            "example": "Вона взяла кусочок соковитого яблука."
                        },
                        {
                            "word": "серендипіті",
                            "meaning": "випадковий розвиток подій, що призводить до щасливого або корисного результату",
                            "usage": "Відкриття пеніциліну було серендипіті в медицині.",
                            "example": "Їхнє зустріч в книжковому магазині було чудовим серендипіті."
                        },
                        {
                            "word": "ксенічний",
                            "meaning": "надзвичайно ідеалістичний; нереалістичний та непрактичний",
                            "usage": "Його ксенічний пошук ідеального світу часто стикається з реальністю.",
                            "example": "Вона вирушила в ксенічну подорож, щоб змінити світ через мистецтво."
                        },
                        {
                            "word": "ефемерний",
                            "meaning": "існуючий лише дуже короткий час",
                            "usage": "Краса квітів вишні є ефемерною, триває всього кілька днів.",
                            "example": "Його слава виявилася ефемерною, швидко вигасаючи після його початкового успіху."
                        },
                        {
                            "word": "резилієнтність",
                            "meaning": "здатність швидко відновлюватися після труднощів; стійкість",
                            "usage": "Громада показала неймовірну резилієнтність перед труднощами.",
                            "example": "Її резилієнтність допомогла їй подолати труднощі і досягти успіху."
                        }
                    ];
            commit('SET_LIST', data);

            setLoading(false);
        }
    },
    getters: {

    }
}
